zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/controller/stm32wb07_06_gap_aci.c
/**
  ******************************************************************************
  * @file    stm32wb07_06_gap_aci.c
  * @author  System Research & Applications Team - Agrate/Catania Lab.
  * @version 1.0.0
  * @date    04-March-2025
  * @brief   Source file for external uC - stm32wb07_06 in network coprocessor mode (gap_aci)
  *          Autogenerated files, do not edit!!
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#include "ble_types.h"
#include "stm32wb07_06_gap_aci.h"
#include "hci_tl.h"

/**
  * @brief Set the IO capabilities of the device. This command cannot be sent
  *        during a pairing procedure.
  * @param io_capability IO capability of the device.
  *        Values:
  *        - 0x00: IO_CAP_DISPLAY_ONLY
  *        - 0x01: IO_CAP_DISPLAY_YES_NO
  *        - 0x02: IO_CAP_KEYBOARD_ONLY
  *        - 0x03: IO_CAP_NO_INPUT_NO_OUTPUT
  *        - 0x04: IO_CAP_KEYBOARD_DISPLAY
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_io_capability(uint8_t io_capability)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_set_io_capability_cp0 *cp0 = (aci_gap_set_io_capability_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->io_capability = HTOB(io_capability, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x085;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief Set the authentication requirements for the device. If the command is
  *        given during pairing, the command returns  BLE_STATUS_NOT_ALLOWED.
  * @param bonding_mode Bonding mode. Only if bonding is enabled (0x01), the
  *        bonding information is stored in flash
  *        Values:
  *        - 0x00: NO_BONDING
  *        - 0x01: BONDING
  * @param mitm_mode MITM mode.
  *        Values:
  *        - 0x00: MITM_PROTECTION_NOT_REQUIRED
  *        - 0x01: MITM_PROTECTION_REQUIRED
  * @param sc_support LE Secure connections support. - 0x00: Secure Connections
  *        Pairing not supported - 0x01: Secure Connections Pairing supported but
  *        optional - 0x02: Secure Connections Pairing supported and mandatory
  *        (SC Only Mode)
  *        Values:
  *        - 0x00: SC_IS_NOT_SUPPORTED
  *        - 0x01: SC_IS_SUPPORTED
  *        - 0x02: SC_IS_MANDATORY
  * @param key_press_notification_support Keypress notification support
  *        Values:
  *        - 0x00: KEYPRESS_IS_NOT_SUPPORTED
  *        - 0x01: KEYPRESS_IS_SUPPORTED
  * @param min_encryption_key_size Minimum encryption key size to be used during
  *        pairing
  *        Values:
  *        - 7 ... 16
  * @param max_encryption_key_size Maximum encryption key size to be used during
  *        pairing
  *        Values:
  *        - 7 ... 16
  * @param use_fixed_pin Use or not fixed pin. If set to 0x00, then during the
  *        pairing process the application will not be requested for a pin
  *        (fixed_pin will be used). If set to 0x01, then during pairing process
  *        if a passkey is required the application will be notified
  *        Values:
  *        - 0x00: USE_FIXED_PIN_FOR_PAIRING
  *        - 0x01: DONOT_USE_FIXED_PIN_FOR_PAIRING
  * @param fixed_pin Fixed pin to be used during pairing if MIMT protection is
  *        enabled. Any random value between 0 to 999999
  *        Values:
  *        - 0 ... 999999
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_authentication_requirement(uint8_t bonding_mode,
                                                    uint8_t mitm_mode,
                                                    uint8_t sc_support,
                                                    uint8_t key_press_notification_support,
                                                    uint8_t min_encryption_key_size,
                                                    uint8_t max_encryption_key_size,
                                                    uint8_t use_fixed_pin,
                                                    uint32_t fixed_pin)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_set_authentication_requirement_cp0 *cp0 = (aci_gap_set_authentication_requirement_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->bonding_mode = HTOB(bonding_mode, 1);
  index_input += 1;
  cp0->mitm_mode = HTOB(mitm_mode, 1);
  index_input += 1;
  cp0->sc_support = HTOB(sc_support, 1);
  index_input += 1;
  cp0->key_press_notification_support = HTOB(key_press_notification_support, 1);
  index_input += 1;
  cp0->min_encryption_key_size = HTOB(min_encryption_key_size, 1);
  index_input += 1;
  cp0->max_encryption_key_size = HTOB(max_encryption_key_size, 1);
  index_input += 1;
  cp0->use_fixed_pin = HTOB(use_fixed_pin, 1);
  index_input += 1;
  cp0->fixed_pin = HTOB(fixed_pin, 4);
  index_input += 4;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x086;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief Set the authorization requirements of the device. This command has to
  *        be given when connected to a device if authorization is required to
  *        access services which require authorization. DEPRECATED API (still
  *        supported but not recommended)
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param authorization_enable Enable the authorization in the device and when a
  *        remote device tries to read/write a characteristic with authorization
  *        requirements, the stack will send back an error response with
  *        "Insufficient authorization" error code. After pairing is complete a
  *        ACI_GAP_AUTHORIZATION_REQ_EVENT will be sent to the Host.
  *        Values:
  *        - 0x00: AUTHORIZATION_NOT_REQUIRED
  *        - 0x01: AUTHORIZATION_REQUIRED
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_authorization_requirement(uint16_t connection_handle,
                                                   uint8_t authorization_enable)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_set_authorization_requirement_cp0 *cp0 = (aci_gap_set_authorization_requirement_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->authorization_enable = HTOB(authorization_enable, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x087;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief This command should be send by the host in response to @ref
  *        aci_gap_pass_key_req_event event. The command parameter contains the
  *        pass key which will be used during the pairing process.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param pass_key Pass key that will be used during the pairing process.  Must
  *        be a six-digit decimal number.
  *        Values:
  *        - 0 ... 999999
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_pass_key_resp(uint16_t connection_handle,
                                   uint32_t pass_key)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_pass_key_resp_cp0 *cp0 = (aci_gap_pass_key_resp_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->pass_key = HTOB(pass_key, 4);
  index_input += 4;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x088;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief Authorize a device to access attributes. This command should be send
  *        by the host in response to @ref aci_gap_authorization_req_event event.
  *        DEPRECATED API (still supported but not recommended)
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param authorize Authorization response.
  *        Values:
  *        - 0x01: Authorize
  *        - 0x02: Reject
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_authorization_resp(uint16_t connection_handle,
                                        uint8_t authorize)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_authorization_resp_cp0 *cp0 = (aci_gap_authorization_resp_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->authorize = HTOB(authorize, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x089;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief Initialize the GAP layer. Register the GAP service with the GATT.
  *        Depending on the role, presence of standard GAP characteristics will
  *        be checked (Device Name, Appearance, Peripheral Preferred Connection
  *        Parameters).  WARNING: A section of the Flash memory is used by this
  *        procedure. When this section is empty, data are written inside. This
  *        normally happens once during the lifetime of the device, when the
  *        command is executed for the first time (unless the section is erased).
  *        Do not power off the device while this function is writing into Flash
  *        memory.
  * @param role Bitmap of allowed roles.
  *        Flags:
  *        - 0x01: Peripheral
  *        - 0x02: Broadcaster
  *        - 0x04: Central
  *        - 0x08: Observer
  * @param privacy_type Specify if privacy is enabled or not and which one .
  *        Values:
  *        - 0x00: Privacy disabled
  *        - 0x01: Privacy host enabled
  *        - 0x02: Privacy controller enabled
  * @param device_name_char_len Length of the device name characteristic
  *        Values:
  *        - 0 ... 248
  * @param identity_address_type Specify which address has to be used as Identity
  *        Address. 0x00: The public address is used as identity address 0x01:
  *        The static random address is used as identity address
  *        Values:
  *        - 0x00: Public Address
  *        - 0x01: Static Random Address
  * @param[out] service_handle Handle of the GAP service
  * @param[out] dev_name_char_handle Device Name Characteristic handle
  * @param[out] appearance_char_handle Appearance Characteristic handle
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_init(uint8_t role,
                          uint8_t privacy_type,
                          uint8_t device_name_char_len,
                          uint8_t identity_address_type,
                          uint16_t *service_handle,
                          uint16_t *dev_name_char_handle,
                          uint16_t *appearance_char_handle)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_init_cp0 *cp0 = (aci_gap_init_cp0 *)(cmd_buffer);
  aci_gap_init_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->role = HTOB(role, 1);
  index_input += 1;
  cp0->privacy_type = HTOB(privacy_type, 1);
  index_input += 1;
  cp0->device_name_char_len = HTOB(device_name_char_len, 1);
  index_input += 1;
  cp0->identity_address_type = HTOB(identity_address_type, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x08a;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *service_handle = BTOH(resp.service_handle, 2);
  *dev_name_char_handle = BTOH(resp.dev_name_char_handle, 2);
  *appearance_char_handle = BTOH(resp.appearance_char_handle, 2);
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief Send a slave security request to the master. This command has to be
  *        issued to notify the master of the security requirements of the slave.
  *        The master may encrypt the link, initiate the pairing procedure, or
  *        reject the request.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_slave_security_req(uint16_t connection_handle)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_slave_security_req_cp0 *cp0 = (aci_gap_slave_security_req_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x08d;
  rq_t.event = 0x0F;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief This command can be used to get the current security settings of the
  *        device.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param[out] security_mode Security mode.
  *             Values:
  *             - 0x01: Security Mode 1
  *             - 0x02: Security Mode 2
  * @param[out] security_level Security Level.
  *             Values:
  *             - 0x01: Security Level 1
  *             - 0x02: Security Level 2
  *             - 0x03: Security Level 3
  *             - 0x04: Security Level 4
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_get_security_level(uint16_t connection_handle,
                                        uint8_t *security_mode,
                                        uint8_t *security_level)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_get_security_level_cp0 *cp0 = (aci_gap_get_security_level_cp0 *)(cmd_buffer);
  aci_gap_get_security_level_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x090;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *security_mode = BTOH(resp.security_mode, 1);
  *security_level = BTOH(resp.security_level, 1);
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief It allows masking events from the GAP. The default configuration is
  *        all the events masked.
  * @param gap_evt_mask GAP event mask. Default: 0xFFFF.
  *        Flags:
  *        - 0x0000: No events
  *        - 0x0001: ACI_GAP_LIMITED_DISCOVERABLE_EVENT
  *        - 0x0002: ACI_GAP_PAIRING_COMPLETE_EVENT
  *        - 0x0004: ACI_GAP_PASS_KEY_REQ_EVENT
  *        - 0x0008: ACI_GAP_AUTHORIZATION_REQ_EVENT
  *        - 0x0010: ACI_GAP_SLAVE_SECURITY_INITIATED_EVENT
  *        - 0x0020: ACI_GAP_BOND_LOST_EVENT
  *        - 0x0080: ACI_GAP_PROC_COMPLETE_EVENT
  *        - 0x0100: ACI_L2CAP_CONNECTION_UPDATE_REQ_EVENT
  *        - 0x0200: ACI_L2CAP_CONNECTION_UPDATE_RESP_EVENT
  *        - 0x0400: ACI_L2CAP_PROC_TIMEOUT_EVENT
  *        - 0x0800: ACI_GAP_ADDR_NOT_RESOLVED_EVENT
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_event_mask(uint16_t gap_evt_mask)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_set_event_mask_cp0 *cp0 = (aci_gap_set_event_mask_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->gap_evt_mask = HTOB(gap_evt_mask, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x091;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief Command the controller to terminate the connection. A @ref
  *        hci_disconnection_complete_event event will be generated when the link
  *        is disconnected. It is important to leave an 100 ms blank window
  *        before sending any new command (including system hardware reset),
  *        since immediately after @ref hci_disconnection_complete_event event,
  *        system could save important information in non volatile memory.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param reason The reason for ending the connection.
  *        Values:
  *        - 0x05: Authentication Failure
  *        - 0x13: Remote User Terminated Connection
  *        - 0x14: Remote Device Terminated Connection due to Low Resources
  *        - 0x15: Remote Device Terminated Connection due to Power Off
  *        - 0x1A: Unsupported Remote Feature
  *        - 0x3B: Unacceptable Connection Parameters
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_terminate(uint16_t connection_handle,
                               uint8_t reason)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_terminate_cp0 *cp0 = (aci_gap_terminate_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->reason = HTOB(reason, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x093;
  rq_t.event = 0x0F;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief Clear the security database. All the devices in the security database
  *        will be removed. ATTENTION: It is strongly recommended not to give
  *        this command during intense radio activity (e.g. during advertising or
  *        connection with short intervals, i.e. less than 30 ms, or during
  *        scanning), since it will trigger an erase of a Flash sector. After
  *        this command, all devices previously recorded in the bonding table and
  *        connected when command has been submitted will remain connected,
  *        preserving authentication and encryption of the link.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_clear_security_db(void)
{
  struct hci_request rq_t;
  ble_status_t status = 0;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x094;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief Allows the security manager to complete the pairing procedure and re-
  *        bond with the master. This command should be given by the application
  *        when it receives the ACI_GAP_BOND_LOST_EVENT if it wants the re-
  *        bonding to happen successfully. If this command is not given on
  *        receiving the event, the bonding procedure will timeout.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_allow_rebond(uint16_t connection_handle)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_allow_rebond_cp0 *cp0 = (aci_gap_allow_rebond_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x095;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

