zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/controller/stm32wb07_06_gap_aci.c
/**
  * @brief Creates a direct connection to a device.
  * @param initiating_phy PHYs that will be used for initiating the connection.
  *        Flags:
  *        - 0x01: LE_1M_PHY_BIT
  *        - 0x04: LE_CODED_PHY_BIT
  * @param peer_address_type The peer_address_type parameter indicates the type
  *        of address used in the connectable advertisement sent by the peer. 0:
  *        Public Device Address or Public Identity Address 1: Random Device
  *        Address or Random (static) Identity Address
  *        Values:
  *        - 0x00: Public Address
  *        - 0x01: Random Address
  * @param peer_address Public Device Address, Random Device Address, Public
  *        Identity Address, or Random (static) Identity Address of the device to
  *        be connected.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_create_connection(uint8_t initiating_phy,
                                       uint8_t peer_address_type,
                                       uint8_t peer_address[6])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_create_connection_cp0 *cp0 = (aci_gap_create_connection_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->initiating_phy = HTOB(initiating_phy, 1);
  index_input += 1;
  cp0->peer_address_type = HTOB(peer_address_type, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->peer_address, (const void *) peer_address, 6);
  index_input += 6;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x09c;
  rq_t.event = 0x0F;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief Terminate the specified GAP procedure. An @ref
  *        aci_gap_proc_complete_event event is generated when the procedure has
  *        been completed, with the procedure code set to the corresponding
  *        procedure.
  * @param procedure_code Code identifying the procedure.
  *        Values:
  *        - 0x00: GAP_LIMITED_DISCOVERY_PROC
  *        - 0x01: GAP_GENERAL_DISCOVERY_PROC
  *        - 0x02: GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC
  *        - 0x03: GAP_GENERAL_CONNECTION_ESTABLISHMENT_PROC
  *        - 0x04: GAP_SELECTIVE_CONNECTION_ESTABLISHMENT_PROC
  *        - 0x05: GAP_OBSERVATION_PROC
  *        - 0x06: GAP_DIRECT_CONNECTION_ESTABLISHMENT_PROC
  *        - 0x07: GAP_NAME_DISCOVERY_PROC
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_terminate_proc(uint8_t procedure_code)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_terminate_proc_cp0 *cp0 = (aci_gap_terminate_proc_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->procedure_code = HTOB(procedure_code, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x09d;
  rq_t.event = 0x0F;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief Start the connection update procedure (only when role is Master). A
  *        @ref hci_le_connection_update is called. On completion of the
  *        procedure, an @ref hci_le_connection_update_complete_event event is
  *        returned to the upper layer.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param conn_interval_min Minimum value for the connection event interval.
  *        This shall be less than or equal to conn_interval_max. Time = N * 1.25
  *        msec.
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param conn_interval_max Maximum value for the connection event interval.
  *        This shall be greater than or equal to conn_interval_min. Time = N *
  *        1.25 msec.
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param conn_latency Slave latency for the connection in number of connection
  *        events.
  *        Values:
  *        - 0x0000 ... 0x01F3
  * @param supervision_timeout Supervision timeout for the LE Link. It shall be a
  *        multiple of 10 ms and larger than (1 + connSlaveLatency) *
  *        connInterval * 2. Time = N * 10 msec.
  *        Values:
  *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms)
  * @param minimum_ce_length Information parameter about the minimum length of
  *        connection needed for this LE connection. Time = N * 0.625 msec.
  * @param maximum_ce_length Information parameter about the maximum length of
  *        connection needed for this LE connection. Time = N * 0.625 msec.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_start_connection_update(uint16_t connection_handle,
                                             uint16_t conn_interval_min,
                                             uint16_t conn_interval_max,
                                             uint16_t conn_latency,
                                             uint16_t supervision_timeout,
                                             uint16_t minimum_ce_length,
                                             uint16_t maximum_ce_length)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_start_connection_update_cp0 *cp0 = (aci_gap_start_connection_update_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->conn_interval_min = HTOB(conn_interval_min, 2);
  index_input += 2;
  cp0->conn_interval_max = HTOB(conn_interval_max, 2);
  index_input += 2;
  cp0->conn_latency = HTOB(conn_latency, 2);
  index_input += 2;
  cp0->supervision_timeout = HTOB(supervision_timeout, 2);
  index_input += 2;
  cp0->minimum_ce_length = HTOB(minimum_ce_length, 2);
  index_input += 2;
  cp0->maximum_ce_length = HTOB(maximum_ce_length, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x09e;
  rq_t.event = 0x0F;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief Send the SM pairing request to start a pairing process. The
  *        authentication requirements and IO capabilities should be set before
  *        issuing this command using the @ref aci_gap_set_io_capability and @ref
  *        aci_gap_set_authentication_requirement commands. A @ref
  *        aci_gap_pairing_complete_event event is returned after the pairing
  *        process is completed.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param force_rebond If 1, Pairing request will be sent even if the device was
  *        previously bonded,  otherwise pairing request is not sent.
  *        Values:
  *        - 0x00: NO
  *        - 0x01: YES
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_send_pairing_req(uint16_t connection_handle,
                                      uint8_t force_rebond)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_send_pairing_req_cp0 *cp0 = (aci_gap_send_pairing_req_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->force_rebond = HTOB(force_rebond, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x09f;
  rq_t.event = 0x0F;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief This command tries to resolve the address provided with the IRKs
  *        present in its database. If the address is resolved successfully with
  *        any one of the IRKs present in the database, it returns success and
  *        also the corresponding public/static random address stored with the
  *        IRK in the database.
  * @param address Address to be resolved
  * @param[out] actual_address The public or static random address of the peer
  *             device, distributed during pairing phase.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_resolve_private_addr(uint8_t address[6],
                                          uint8_t actual_address[6])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_resolve_private_addr_cp0 *cp0 = (aci_gap_resolve_private_addr_cp0 *)(cmd_buffer);
  aci_gap_resolve_private_addr_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  STM32WB07_06_MEMCPY((void *) &cp0->address, (const void *) address, 6);
  index_input += 6;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0a0;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  STM32WB07_06_MEMCPY((void *) actual_address, (const void *) resp.actual_address, 6);
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief This command returns the identity addresses of the bonded devices.
  * @param offset Index of the first record to be returned.
  * @param max_num_of_addresses Used to specify the maximum number of devices to
  *        be returned.
  * @param[out] num_of_addresses The number of bonded devices returned by this
  *             command.
  * @param[out] bonded_device_entry See @ref bonded_device_entry_t
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_get_bonded_devices(uint8_t offset,
                                        uint8_t max_num_of_addresses,
                                        uint8_t *num_of_addresses,
                                        bonded_device_entry_t bonded_device_entry[])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_get_bonded_devices_cp0 *cp0 = (aci_gap_get_bonded_devices_cp0 *)(cmd_buffer);
  aci_gap_get_bonded_devices_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->offset = HTOB(offset, 1);
  index_input += 1;
  cp0->max_num_of_addresses = HTOB(max_num_of_addresses, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0a3;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *num_of_addresses = BTOH(resp.num_of_addresses, 1);
  STM32WB07_06_MEMCPY((void *) bonded_device_entry, (const void *) resp.bonded_device_entry,
                 *num_of_addresses * sizeof(bonded_device_entry_t));
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief The command finds whether the device, whose address is specified in
  *        the command, is bonded. If the device is using a resolvable private
  *        address and it has been bonded, then the command will return
  *        BLE_STATUS_SUCCESS.
  * @param peer_address_type Address type.
  *        Values:
  *        - 0x00: Public Device Address
  *        - 0x01: Random Device Address
  * @param peer_address Address used by the peer device while advertising
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_is_device_bonded(uint8_t peer_address_type,
                                      uint8_t peer_address[6])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_is_device_bonded_cp0 *cp0 = (aci_gap_is_device_bonded_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->peer_address_type = HTOB(peer_address_type, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->peer_address, (const void *) peer_address, 6);
  index_input += 6;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0a4;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief This command allows the User to validate/confirm or not the Numeric
  *        Comparison value showed through the
  *        ACI_GAP_Numeric_Comparison_Value_Event.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param confirm_yes_no 0 : The Numeric Values showed on both local and peer
  *        device are different! 1 : The Numeric Values showed on both local and
  *        peer device are equal!
  *        Values:
  *        - 0x00: No
  *        - 0x01: YES
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_numeric_comparison_value_confirm_yesno(uint16_t connection_handle,
                                                            uint8_t confirm_yes_no)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_numeric_comparison_value_confirm_yesno_cp0 *cp0 =
    (aci_gap_numeric_comparison_value_confirm_yesno_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->confirm_yes_no = HTOB(confirm_yes_no, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0a5;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief This command permits to signal to the Stack the input type detected
  *        during Passkey input.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param input_type Passkey input type detected
  *        Values:
  *        - 0x00: Passkey entry started
  *        - 0x01: Passkey digit entered
  *        - 0x02: Passkey digit erased
  *        - 0x03: Passkey cleared
  *        - 0x04: Passkey entry completed
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_passkey_input(uint16_t connection_handle,
                                   uint8_t input_type)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_passkey_input_cp0 *cp0 = (aci_gap_passkey_input_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->input_type = HTOB(input_type, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0a6;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief This command is sent by the User to get (i.e. to extract from the
  *        Stack) the OOB data generated by the Stack itself. In a complete
  *        system (i.e. having an OOB channel fully handled) this command should
  *        be invoked by the OOB Channel manager to require the local OOB data
  *        (hence without user interaction) to be sent via OOB to the remote peer
  *        candidate device. The requested OOB data are returned in response to
  *        the incoming command. The OOB data are not generated on the fly, but
  *        they are already available in the Stack.
  * @param oob_data_type OOB Data type. - 0x00: Legacy Privacy (LP) v.4.1 TK
  *        (Temporary Key) - 0x01: Secure Connections (SC) v.4.2 Random value r
  *        used for generation of Confirm value - 0x02: Secure Connections (SC)
  *        v.4.2 Confirm value C generated through AES-CMAC-128 based
  *        cryptographic function: C=f4(PKx, PKx, r, 0)
  *        Values:
  *        - 0x00: SM_TK
  *        - 0x01: SM_RANDOM_VALUE
  *        - 0x02: SM_CONFIRM_VALUE
  * @param[out] address_type Identity address type.
  *             Values:
  *             - 0x00: Public Identity Address
  *             - 0x01: Random (static) Identity Address
  * @param[out] address Public or Random (static) address of this  device
  * @param[out] oob_data_len Length of OOB Data carried by next data field
  * @param[out] oob_data OOB Data to be exported via OOB.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_get_oob_data(uint8_t oob_data_type,
                                  uint8_t *address_type,
                                  uint8_t address[6],
                                  uint8_t *oob_data_len,
                                  uint8_t oob_data[16])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_get_oob_data_cp0 *cp0 = (aci_gap_get_oob_data_cp0 *)(cmd_buffer);
  aci_gap_get_oob_data_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->oob_data_type = HTOB(oob_data_type, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0a7;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *address_type = BTOH(resp.address_type, 1);
  STM32WB07_06_MEMCPY((void *) address, (const void *) resp.address, 6);
  *oob_data_len = BTOH(resp.oob_data_len, 1);
  STM32WB07_06_MEMCPY((void *) oob_data, (const void *) resp.oob_data, 16);
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief This command is sent (by the User) to input the OOB data arrived via
  *        OOB communication. It may be sent to set either the OOB Authentication
  *        data of the Local device, or the data received via OOB by the Remote
  *        peer candidate device. It can be used with oob_data_len set to 0 to
  *        generate OOB authentication data for Secure Connections. In a complete
  *        system (i.e. having an OOB channel fully handled) this command should
  *        be invoked by the OOB Channel manager when receiving the OOB data
  *        (hence without user interaction). Since the BLE stack v 2.x
  *        implementation supports just one entry for the Remote peer candidate
  *        list containing the OOB data, at every command invocation the data
  *        existing in that entry are overwritten.
  * @param device_type OOB Device type:  - 0x00: The Address information are
  *        ignored.    - oob_data_len= 0x00: this triggers the automatic
  *        regeneration of OOB Authentication data (for Secure Connections only).
  *        - oob_data_len in [0..16]: the oob_data carried by the command will
  *        overwrite the current local Authentication OOB Data.  - 0x01: The
  *        Address information is used to search the entry of the Remote peer
  *        candidate list containing the OOB data for that specific remote
  *        device; if no entry exists, a new entry is used, if available (current
  *        implementation supports only 1 entry in this list).    - oob_data_len
  *        in [0..16]: the oob_data carried by the command overwrites (if
  *        present) the remote Authentication OOB Data.
  *        Values:
  *        - 0x00: Local device
  *        - 0x01: Remote device
  * @param address_type Identity address type.
  *        Values:
  *        - 0x00: Public Identity Address
  *        - 0x01: Random (static) Identity Address
  * @param address Public or Random (static) address of the peer device
  * @param oob_data_type OOB Data type. - 0x00: Legacy Privacy (LP) v.4.1 TK
  *        (Temporary Key) - 0x01: Secure Connections (SC) v.4.2 Random value r
  *        used for generation of Confirm value - 0x02: Secure Connections (SC)
  *        v.4.2 Confirm value C generated through AES-CMAC-128 based
  *        cryptographic function: C=f4(PKx, PKx, r, 0)
  *        Values:
  *        - 0x00: SM_TK
  *        - 0x01: SM_RANDOM_VALUE
  *        - 0x02: SM_CONFIRM_VALUE
  * @param oob_data_len Length of OOB Data carried by next data field
  *        Values:
  *        - 0x00 ... 0x10
  * @param oob_data OOB Data to be exported via OOB.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_oob_data(uint8_t device_type,
                                  uint8_t address_type,
                                  uint8_t address[6],
                                  uint8_t oob_data_type,
                                  uint8_t oob_data_len,
                                  uint8_t oob_data[16])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_set_oob_data_cp0 *cp0 = (aci_gap_set_oob_data_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->device_type = HTOB(device_type, 1);
  index_input += 1;
  cp0->address_type = HTOB(address_type, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->address, (const void *) address, 6);
  index_input += 6;
  cp0->oob_data_type = HTOB(oob_data_type, 1);
  index_input += 1;
  cp0->oob_data_len = HTOB(oob_data_len, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->oob_data, (const void *) oob_data, 16);
  index_input += 16;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0a8;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

