zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/controller/stm32wb07_06_gap_aci.c
/**
  * @brief This command can be used to remove a specified device from the bonding
  *        table. ATTENTION: the device removed from the Bonding Table will
  *        preserve its connection and authentication, until explicit
  *        disconnection is requested by the user.
  * @param peer_identity_address_type Identity address type.
  *        Values:
  *        - 0x00: Public Identity Address
  *        - 0x01: Random (static) Identity Address
  * @param peer_identity_address Public or Random (static) Identity address of
  *        the peer device
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_remove_bonded_device(uint8_t peer_identity_address_type,
                                          uint8_t peer_identity_address[6])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_remove_bonded_device_cp0 *cp0 = (aci_gap_remove_bonded_device_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->peer_identity_address_type = HTOB(peer_identity_address_type, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->peer_identity_address, (const void *) peer_identity_address, 6);
  index_input += 6;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0aa;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief This commands configures the advertising parameters for the legacy
  *        advertising or for a given extended advertising set.
  * @param advertising_handle Used to identify an advertising set. This parameter
  *        is only meaningful if Extended Advertising Feature is enabled.
  *        Values:
  *        - 0x00 ... 0xEF
  * @param discoverable_mode Specifies the discoverable mode of the device.
  *        Values:
  *        - 0: Not Discoverable
  *        - 1: Limited Discoverable
  *        - 2: General Discoverable
  *        - 3: Broadcast
  * @param advertising_event_properties The advertising_event_properties
  *        parameter describes the type of advertising event that is being
  *        configured and its basic properties according to V5.1, Vol 2, Part E,
  *        section 7.8.53.
  *        Flags:
  *        - 0x0001: Connectable
  *        - 0x0002: Scannable
  *        - 0x0004: Directed
  *        - 0x0008: High Duty Cycle Directed Connectable
  *        - 0x0010: Legacy
  *        - 0x0020: Anonymous
  *        - 0x0040: Include TX Power
  * @param primary_advertising_interval_min Minimum advertising interval for
  *        undirected and low duty cycle directed advertising. Time = N * 0.625
  *        msec.
  *        Values:
  *        - 0x00000020 (20.000 ms)  ... 0x00FFFFFF (10485759.375 ms)
  * @param primary_advertising_interval_max Maximum advertising interval for
  *        undirected and low duty cycle directed advertising. Time = N * 0.625
  *        msec.
  *        Values:
  *        - 0x00000020 (20.000 ms)  ... 0x00FFFFFF (10485759.375 ms)
  * @param primary_advertising_channel_map It is a bit field that indicates the
  *        advertising channels that shall be used when transmitting advertising
  *        packets.
  *        Flags:
  *        - 0x01: CH_37
  *        - 0x02: CH_38
  *        - 0x04: CH_39
  * @param peer_address_type The peer address type.
  *        Values:
  *        - 0x00: Public
  *        - 0x01: Random
  * @param peer_address Public Device Address, Random Device Address, Public
  *        Identity Address, or Random (static) Identity Address of the device to
  *        be connected.
  * @param advertising_filter_policy Advertising Filter Policy. If Directed
  *        advertising is selected, the peer_address_type and peer_address shall
  *        be valid and the advertising_filter_policy parameter shall be ignored.
  *        0x00 Process scan and connection requests from all devices (i.e., the
  *        White List is not in use) 0x01 Process connection requests from all
  *        devices and scan requests only from devices that are in the White List
  *        0x02 Process scan requests from all devices and connection requests
  *        only from devices that are in the White List. 0x03 Process scan and
  *        connection requests only from devices in the White List. All other
  *        values Reserved for future use
  *        Values:
  *        - 0x00: Scan and Connection requests from any
  *        - 0x01: Connection requests from any, scan requests from White List only
  *        - 0x02: Scan requests from any, connection requests from White List only
  *        - 0x03: Scan and connection requests from White
List only
  * @param advertising_tx_power The advertising_tx_power parameter indicates the
  *        maximum power level at which the advertising packets are to be
  *        transmitted on the advertising channels. The Controller shall choose a
  *        power level lower than or equal to the one specified by the Host.
  *        (Units: dBm). This parameter is ignored if extended advertising is not
  *        enabled.
  *        Values:
  *        - -127 ... 126
  *        - 127: No preference
  * @param primary_advertising_phy The primary_advertising_phy parameter
  *        indicates the PHY on which the advertising packets are transmitted on
  *        the primary advertising channel. If legacy advertising PDUs are being
  *        used, the primary_advertising_phy shall indicate the LE 1M PHY. This
  *        parameter is ignored if extended advertising is not enabled.
  *        Values:
  *        - 0x01: LE_1M_PHY
  *        - 0x03: LE_CODED_PHY
  * @param secondary_advertising_max_skip The secondary_advertising_max_skip
  *        parameter is the maximum number of advertising events that can be
  *        skipped before the AUX_ADV_IND can be sent. This parameter is ignored
  *        if extended advertising is not enabled. 0x00 AUX_ADV_IND shall be sent
  *        prior to the next advertising event 0x01-0xFF Maximum advertising
  *        events the Controller can skip before sending the AUX_ADV_IND packets
  *        on the secondary advertising channel
  * @param secondary_advertising_phy The secondary_advertising_phy parameter
  *        indicates the PHY on which the advertising packets are be transmitted
  *        on the secondary advertising channel. This parameter is ignored if
  *        extended advertising is not enabled.
  *        Values:
  *        - 0x01: LE_1M_PHY
  *        - 0x02: LE_2M_PHY
  *        - 0x03: LE_CODED_PHY
  * @param advertising_sid The advertising_sid parameter specifies the value to
  *        be transmitted in the Advertising SID subfield of the ADI field of the
  *        Extended Header of those advertising channel PDUs that have an ADI
  *        field. If the advertising set only uses PDUs that do not contain an
  *        ADI field, advertising_sid is ignored. This parameter is ignored if
  *        extended advertising is not enabled.
  *        Values:
  *        - 0x00 ... 0x0F
  * @param scan_request_notification_enable The scan_request_notification_enable
  *        parameter indicates whether the Controller shall send notifications
  *        upon the receipt of a scan request PDU that is in response to an
  *        advertisement from the specified advertising set that contains its
  *        device address and is from a scanner that is allowed by the
  *        advertising filter policy. This parameter is ignored if extended
  *        advertising is not enabled.
  *        Values:
  *        - 0x00: Scan request notifications disabled
  *        - 0x01: Scan request notifications enabled
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_advertising_configuration(uint8_t advertising_handle,
                                                   uint8_t discoverable_mode,
                                                   uint16_t advertising_event_properties,
                                                   uint32_t primary_advertising_interval_min,
                                                   uint32_t primary_advertising_interval_max,
                                                   uint8_t primary_advertising_channel_map,
                                                   uint8_t peer_address_type,
                                                   uint8_t peer_address[6],
                                                   uint8_t advertising_filter_policy,
                                                   int8_t advertising_tx_power,
                                                   uint8_t primary_advertising_phy,
                                                   uint8_t secondary_advertising_max_skip,
                                                   uint8_t secondary_advertising_phy,
                                                   uint8_t advertising_sid,
                                                   uint8_t scan_request_notification_enable)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_set_advertising_configuration_cp0 *cp0 = (aci_gap_set_advertising_configuration_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->advertising_handle = HTOB(advertising_handle, 1);
  index_input += 1;
  cp0->discoverable_mode = HTOB(discoverable_mode, 1);
  index_input += 1;
  cp0->advertising_event_properties = HTOB(advertising_event_properties, 2);
  index_input += 2;
  cp0->primary_advertising_interval_min = HTOB(primary_advertising_interval_min, 4);
  index_input += 4;
  cp0->primary_advertising_interval_max = HTOB(primary_advertising_interval_max, 4);
  index_input += 4;
  cp0->primary_advertising_channel_map = HTOB(primary_advertising_channel_map, 1);
  index_input += 1;
  cp0->peer_address_type = HTOB(peer_address_type, 1);
  index_input += 1;
  if (peer_address != NULL)
  {
    STM32WB07_06_MEMCPY((void *) &cp0->peer_address, (const void *) peer_address, 6);
  }
  index_input += 6;
  cp0->advertising_filter_policy = HTOB(advertising_filter_policy, 1);
  index_input += 1;
  cp0->advertising_tx_power = HTOB(advertising_tx_power, 1);
  index_input += 1;
  cp0->primary_advertising_phy = HTOB(primary_advertising_phy, 1);
  index_input += 1;
  cp0->secondary_advertising_max_skip = HTOB(secondary_advertising_max_skip, 1);
  index_input += 1;
  cp0->secondary_advertising_phy = HTOB(secondary_advertising_phy, 1);
  index_input += 1;
  cp0->advertising_sid = HTOB(advertising_sid, 1);
  index_input += 1;
  cp0->scan_request_notification_enable = HTOB(scan_request_notification_enable, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0ab;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief The LE_Set_Extended_Advertising_Enable command is used to request the
  *        Controller to enable or disable one or more advertising sets using the
  *        advertising sets identified by the advertising_handle[i] parameter.
  *        The Controller manages the timing of advertisements in accordance with
  *        the advertising parameters given in the
  *        LE_Set_Extended_Advertising_Parameters command. Only Enable parameter
  *        is used if extended advertising feature is disabled through modular
  *        configuration (CONTROLLER_EXT_ADV_SCAN_ENABLED=0).
  * @param Enable It allows to enable or disable one or more advertising sets
  *        using the advertising sets identified by the advertising_handle[i]
  *        parameter.
  *        Values:
  *        - 0x00: Disable
  *        - 0x01: Enable
  * @param number_of_sets The number_of_sets parameter is the number of
  *        advertising sets contained in the parameter arrays. 0x00: Disable all
  *        advertising sets 0x01 to 0x3F: Number of advertising sets to enable or
  *        disable. Ignored if extended advertising feature is disabled through
  *        modular configuration (CONTROLLER_EXT_ADV_SCAN_ENABLED=0).
  *        Values:
  *        - 0x00: Disable all sets
  *        - 0x01 ... 0x3F
  * @param advertising_set_parameters See @ref advertising_set_parameters_t
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_advertising_enable(uint8_t enable,
                                            uint8_t number_of_sets,
                                            advertising_set_parameters_t advertising_set_parameters[])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_set_advertising_enable_cp0 *cp0 = (aci_gap_set_advertising_enable_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->enable = HTOB(enable, 1);
  index_input += 1;
  cp0->number_of_sets = HTOB(number_of_sets, 1);
  index_input += 1;
  /* var_len_data input */
  {
    for (uint32_t index = 0; index < number_of_sets; index++)
    {
      cp0->advertising_set_parameters[index].advertising_handle = advertising_set_parameters[index].advertising_handle;
      cp0->advertising_set_parameters[index].duration = advertising_set_parameters[index].duration;
      cp0->advertising_set_parameters[index].max_extended_advertising_events =
        advertising_set_parameters[index].max_extended_advertising_events;
    }
    index_input += number_of_sets * 4;
  }
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0ac;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief The ACI_GAP_SET_ADVERTISING_DATA_NWK function is used to set the data
  *        in advertising PDUs.  If the device is in Limited Discoverable Mode,
  *        Flags data type in advertising data must have the flags set as
  *        described: - The LE Limited Discoverable Mode flag set to one. - The
  *        'BR/EDR Not Supported' flag set to one. - All other flags set to zero.
  *        If the device is in General Discoverable Mode, Flags data type in
  *        advertising data must have the flags set as described: - The LE
  *        General Discoverable Mode flag set to one. - The 'BR/EDR Not
  *        Supported' flag set to one. - All other flags set to zero.  If the
  *        device is in one of the other modes, Flags data type in advertising
  *        data must have the flags set as described: - The 'BR/EDR Not
  *        Supported' flag set to one. - All other flags set to zero.  If a
  *        device is sending non connectable events, Flags data type may be
  *        omitted, otherwise it must be present.
  * @param advertising_handle Used to identify an advertising set. This parameter
  *        is only meaningful if Extended Advertising Feature is enabled.
  *        Values:
  *        - 0x00 ... 0xEF
  * @param operation The Host may set the advertising data in one or more
  *        operations using this parameter. 0x00: Intermediate fragment of
  *        fragmented extended advertising data 0x01: First fragment of
  *        fragmented extended advertising data 0x02: Last fragment of fragmented
  *        extended advertising data 0x03: Complete extended advertising data
  *        0x04: Unchanged data (just update the Advertising DID) All other
  *        values: Reserved for future use
  *        Values:
  *        - 0x00: Intermediate fragment
  *        - 0x01: First fragment
  *        - 0x02: Last fragment
  *        - 0x03: Complete data
  *        - 0x04: Unchanged data
  * @param advertising_data_length Length of advertising data. For legacy PDUs
  *        which supports advertising data maximum value is 31 octets.
  *        Values:
  *        - 0 ... 251
  * @param advertising_data Advertising data, that must be properly formatted
  *        (see Core v5.1 Vol 3, part C, chapter 11).
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_advertising_data_nwk(uint8_t advertising_handle,
                                              uint8_t operation,
                                              uint8_t advertising_data_length,
                                              uint8_t advertising_data[])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_set_advertising_data_nwk_cp0 *cp0 = (aci_gap_set_advertising_data_nwk_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->advertising_handle = HTOB(advertising_handle, 1);
  index_input += 1;
  cp0->operation = HTOB(operation, 1);
  index_input += 1;
  cp0->advertising_data_length = HTOB(advertising_data_length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB07_06_MEMCPY((void *) &cp0->advertising_data,
                   (const void *) advertising_data,
                   advertising_data_length * sizeof(uint8_t));
    index_input += advertising_data_length * sizeof(uint8_t);
  }
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0ad;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief The ACI_GAP_SET_SCAN_RESPONSE_DATA function configures the scan
  *        response data as requested by the application.
  * @param advertising_handle Used to identify an advertising set. This parameter
  *        is only meaningful if Extended Advertising Feature is enabled.
  *        Values:
  *        - 0x00 ... 0xEF
  * @param operation The Host may set the scan response data in one or more
  *        operations using the operation parameter in the command. 0x00:
  *        Intermediate fragment of fragmented scan response data 0x01: First
  *        fragment of fragmented scan response data 0x02: Last fragment of
  *        fragmented scan response data 0x03: Complete scan response data All
  *        other values: Reserved for future use
  *        Values:
  *        - 0x00: Intermediate fragment
  *        - 0x01: First fragment
  *        - 0x02: Last fragment
  *        - 0x03: Complete data
  * @param scan_response_data_length Length of scan response data. If the
  *        advertising set uses scannable legacy advertising PDUs maximum length
  *        is 31 octets.
  *        Values:
  *        - 0 ... 251
  * @param scan_response_data Scan response data, that must be properly formatted
  *        (see Core v5.1 Vol 3, part C, chapter 11).
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_scan_response_data_nwk(uint8_t advertising_handle,
                                                uint8_t operation,
                                                uint8_t scan_response_data_length,
                                                uint8_t scan_response_data[])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_set_scan_response_data_nwk_cp0 *cp0 = (aci_gap_set_scan_response_data_nwk_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->advertising_handle = HTOB(advertising_handle, 1);
  index_input += 1;
  cp0->operation = HTOB(operation, 1);
  index_input += 1;
  cp0->scan_response_data_length = HTOB(scan_response_data_length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB07_06_MEMCPY((void *) &cp0->scan_response_data,
                   (const void *) scan_response_data,
                   scan_response_data_length * sizeof(uint8_t));
    index_input += scan_response_data_length * sizeof(uint8_t);
  }
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0ae;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

