zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/controller/stm32wb07_06_gap_aci.c
/**
  * @brief The ACI_GAP_SET_SCAN_CONFIGURATION function configures the scan
  *        parameters for a given PHY. To configure more than one PHY, this
  *        function must be called more times.
  * @param filter_duplicates The filter_duplicates parameter controls whether the
  *        Link Layer should filter out duplicate advertising reports (filtering
  *        duplicates enabled) to the Host or if the Link Layer should generate
  *        advertising reports for each packet received (filtering duplicates
  *        disabled). See [Vol 6] Part B, Section 4.4.3.5.
  *        Values:
  *        - 0x00: Duplicate filtering disabled
  *        - 0x01: Duplicate filtering enabled
  *        - 0x02: Duplicate filtering enabled, reset for each scan period
  * @param scanning_filter_policy 0x00 Accept all advertisement packets. Directed
  *        advertising packets which are not addressed for this device shall be
  *        ignored. 0x01 Ignore advertisement packets from devices not in the
  *        White List Only. Directed advertising packets which are not addressed
  *        for this device shall be ignored 0x02 Accept all undirected
  *        advertisement packets. Directed advertisement packets where initiator
  *        address is a RPA and  Directed advertisement packets addressed to this
  *        device shall be accepted. 0x03 Accept all undirected advertisement
  *        packets from devices that are in the White List.Directed advertisement
  *        packets where initiator address is RPA and Directed advertisement
  *        packets addressed to this device shall be accepted.
  *        Values:
  *        - 0x00: Accept All
  *        - 0x01: White List Only
  *        - 0x02: Accept All (use resolving list)
  *        - 0x03: White List Only (use resolving list)
  * @param Scanning_PHY PHY that is going to be configured. Only one bit can be
  *        set.
  *        Flags:
  *        - 0x01: LE_1M_PHY_BIT
  *        - 0x04: LE_CODED_PHY_BIT
  * @param scan_type The scan_type parameter specifies the type of scan to
  *        perform. 0: Passive Scanning. No scan request PDUs shall be sent. 1:
  *        Active Scanning. Scan request PDUs may be sent.
  *        Values:
  *        - 0x00: Passive Scanning
  *        - 0x01: Active Scanning
  * @param scan_interval Time interval from when the Controller started its last
  *        scan until it begins the subsequent scan on the primary advertising
  *        physical channel.  Time = N * 0.625 ms
  *        Values:
  *        - 0x0004 (2.500 ms)  ... 0xFFFF (40959.375 ms)
  * @param scan_window Time interval from when the Controller started its last
  *        scan until it begins the subsequent scan on the primary advertising
  *        physical channel. Time = N * 0.625 msec.
  *        Values:
  *        - 0x0004 (2.500 ms)  ... 0xFFFF (40959.375 ms)
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_scan_configuration(uint8_t filter_duplicates,
                                            uint8_t scanning_filter_policy,
                                            uint8_t Scanning_PHY,
                                            uint8_t scan_type,
                                            uint16_t scan_interval,
                                            uint16_t scan_window)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_set_scan_configuration_cp0 *cp0 = (aci_gap_set_scan_configuration_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->filter_duplicates = HTOB(filter_duplicates, 1);
  index_input += 1;
  cp0->scanning_filter_policy = HTOB(scanning_filter_policy, 1);
  index_input += 1;
  cp0->Scanning_PHY = HTOB(Scanning_PHY, 1);
  index_input += 1;
  cp0->scan_type = HTOB(scan_type, 1);
  index_input += 1;
  cp0->scan_interval = HTOB(scan_interval, 2);
  index_input += 2;
  cp0->scan_window = HTOB(scan_window, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0af;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief This function configures the connection parameters. To configure more
  *        than one PHY, this function must be called more times.
  * @param initiating_phy PHY that is going to be configured. Only one bit can be
  *        set.
  *        Flags:
  *        - 0x01: LE_1M_PHY_BIT
  *        - 0x02: LE_2M_PHY_BIT
  *        - 0x04: LE_CODED_PHY_BIT
  * @param conn_interval_min Minimum value for the connection event interval.
  *        This shall be less than or equal to conn_interval_max. Time = N * 1.25
  *        msec.
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param conn_interval_max Maximum value for the connection event interval.
  *        This shall be greater than or equal to conn_interval_min. Time = N *
  *        1.25 msec.
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param conn_latency Slave latency for the connection in number of connection
  *        events.
  *        Values:
  *        - 0x0000 ... 0x01F3
  * @param supervision_timeout Supervision timeout for the LE Link. It shall be a
  *        multiple of 10 ms and larger than (1 + connSlaveLatency) *
  *        connInterval * 2. Time = N * 10 msec.
  *        Values:
  *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms)
  * @param minimum_ce_length Information parameter about the minimum length of
  *        connection needed for this LE connection. Time = N * 0.625 msec.
  * @param maximum_ce_length Information parameter about the maximum length of
  *        connection needed for this LE connection. Time = N * 0.625 msec.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_connection_configuration(uint8_t initiating_phy,
                                                  uint16_t conn_interval_min,
                                                  uint16_t conn_interval_max,
                                                  uint16_t conn_latency,
                                                  uint16_t supervision_timeout,
                                                  uint16_t minimum_ce_length,
                                                  uint16_t maximum_ce_length)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_set_connection_configuration_cp0 *cp0 = (aci_gap_set_connection_configuration_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->initiating_phy = HTOB(initiating_phy, 1);
  index_input += 1;
  cp0->conn_interval_min = HTOB(conn_interval_min, 2);
  index_input += 2;
  cp0->conn_interval_max = HTOB(conn_interval_max, 2);
  index_input += 2;
  cp0->conn_latency = HTOB(conn_latency, 2);
  index_input += 2;
  cp0->supervision_timeout = HTOB(supervision_timeout, 2);
  index_input += 2;
  cp0->minimum_ce_length = HTOB(minimum_ce_length, 2);
  index_input += 2;
  cp0->maximum_ce_length = HTOB(maximum_ce_length, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0b0;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief Starts a GAP procedure according to the procedure code.
  * @param procedure_code Procedure to be started.
  *        Values:
  *        - 0x00: GAP_LIMITED_DISCOVERY_PROC
  *        - 0x01: GAP_GENERAL_DISCOVERY_PROC
  *        - 0x02: GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC
  *        - 0x03: GAP_GENERAL_CONNECTION_ESTABLISHMENT_PROC
  *        - 0x04: GAP_SELECTIVE_CONNECTION_ESTABLISHMENT_PROC
  *        - 0x05: GAP_OBSERVATION_PROC
  * @param phy_s PHYs that will be used for Scanning or Initiating .
  *        Flags:
  *        - 0x01: LE_1M_PHY_BIT
  *        - 0x04: LE_CODED_PHY_BIT
  * @param duration Ignored. Reserved for future use.
  * @param period Ignored. Reserved for future use.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_start_procedure(uint8_t procedure_code,
                                     uint8_t phy_s,
                                     uint16_t duration,
                                     uint16_t period)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_start_procedure_cp0 *cp0 = (aci_gap_start_procedure_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->procedure_code = HTOB(procedure_code, 1);
  index_input += 1;
  cp0->phy_s = HTOB(phy_s, 1);
  index_input += 1;
  cp0->duration = HTOB(duration, 2);
  index_input += 2;
  cp0->period = HTOB(period, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0b1;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief Creates a direct connection to a device and read the name
  *        characteristic.
  * @param phy_s PHYs that will be used for initiating the connection.
  *        Flags:
  *        - 0x01: LE_1M_PHY_BIT
  *        - 0x04: LE_CODED_PHY_BIT
  * @param peer_address_type The peer_address_type parameter indicates the type
  *        of address used in the connectable advertisement sent by the peer. 0:
  *        Public Device Address or Public Identity Address 1: Random Device
  *        Address or Random (static) Identity Address
  *        Values:
  *        - 0x00: Public Address
  *        - 0x01: Random Address
  * @param peer_address Public Device Address, Random Device Address, Public
  *        Identity Address, or Random (static) Identity Address of the device to
  *        be connected.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_discover_name(uint8_t phy_s,
                                   uint8_t peer_address_type,
                                   uint8_t peer_address[6])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_discover_name_cp0 *cp0 = (aci_gap_discover_name_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->phy_s = HTOB(phy_s, 1);
  index_input += 1;
  cp0->peer_address_type = HTOB(peer_address_type, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->peer_address, (const void *) peer_address, 6);
  index_input += 6;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0b2;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief Add specific device addresses to the white and/or resolving list.
  * @param lists Select in which list the device addresses will be added: white
  *        list, resolving list or both.
  *        Flags:
  *        - 0x01: White List
  *        - 0x02: Resolving List
  * @param clear_lists Clear the selected lists before adding the device
  *        addresses.
  *        Values:
  *        - 0x00: Do not clear
  *        - 0x01: Clear before adding
  * @param num_of_list_entries Number of devices that have to be added to the
  *        whitelist.
  *        Values:
  *        - 0x00 ... 0xFF
  * @param list_entry See @ref list_entry_t
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_add_devices_to_white_and_resolving_list(uint8_t lists,
                                                             uint8_t clear_lists,
                                                             uint8_t num_of_list_entries,
                                                             list_entry_t list_entry[])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_add_devices_to_white_and_resolving_list_cp0 *cp0 =
    (aci_gap_add_devices_to_white_and_resolving_list_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->lists = HTOB(lists, 1);
  index_input += 1;
  cp0->clear_lists = HTOB(clear_lists, 1);
  index_input += 1;
  cp0->num_of_list_entries = HTOB(num_of_list_entries, 1);
  index_input += 1;
  /* var_len_data input */
  {
    for (uint32_t index = 0; index < num_of_list_entries; index++)
    {
      cp0->list_entry[index].peer_address_type = list_entry[index].peer_address_type;
      STM32WB07_06_MEMCPY((void *) &cp0->list_entry[index].peer_address,
                     (const void *) &list_entry[index].peer_address,
                     6);
    }
    index_input += num_of_list_entries * 7;
  }
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0b3;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief Clear the specified lists and add all bonded devices.
  * @param lists Select in which list the device addresses will be added: white
  *        list, resolving list or both.
  *        Flags:
  *        - 0x01: White List
  *        - 0x02: Resolving List
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_configure_white_and_resolving_list(uint8_t lists)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_configure_white_and_resolving_list_cp0 *cp0 = (aci_gap_configure_white_and_resolving_list_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->lists = HTOB(lists, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0b4;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief The GAP_Set_Periodic_Advertising_Configuration command is used by the
  *        Host to set the parameters for periodic advertising. See
  *        hci_le_set_periodic_advertising_parameters().
  * @param advertising_handle It is used to identify an advertising set
  *        Values:
  *        - 0x00 ... 0xEF: Used to identify a periodic advertisement
  * @param periodic_advertising_interval_min Minimum advertising interval for
  *        periodic advertising. Time = N * 1.25 ms; Time Range: 7.5ms to
  *        81.91875 s.
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) : Minimum advertising interval for periodic advertising.
  * @param periodic_advertising_interval_max Maximum advertising interval for
  *        periodic advertising. Time = N * 1.25 ms; Time Range: 7.5ms to
  *        81.91875 s.
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) : Maximum advertising interval for periodic advertising.
  * @param periodic_advertising_properties The periodic_advertising_properties
  *        parameter indicates which fields should be included in the advertising
  *        packet.
  *        Flags:
  *        - 0x0040: Include TxPower in the advertising PDU
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_periodic_advertising_configuration(uint8_t advertising_handle,
                                                            uint16_t periodic_advertising_interval_min,
                                                            uint16_t periodic_advertising_interval_max,
                                                            uint16_t periodic_advertising_properties)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_set_periodic_advertising_configuration_cp0 *cp0 =
    (aci_gap_set_periodic_advertising_configuration_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->advertising_handle = HTOB(advertising_handle, 1);
  index_input += 1;
  cp0->periodic_advertising_interval_min = HTOB(periodic_advertising_interval_min, 2);
  index_input += 2;
  cp0->periodic_advertising_interval_max = HTOB(periodic_advertising_interval_max, 2);
  index_input += 2;
  cp0->periodic_advertising_properties = HTOB(periodic_advertising_properties, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0b5;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief The GAP_Set_Periodic_Advertising_Data command is used to set the data
  *        used in periodic advertising PDUs. See
  *        hci_le_set_periodic_advertising_data().
  * @param advertising_handle It is used to identify an advertising set
  *        Values:
  *        - 0x00 ... 0xEF: Used to identify an advertising set
  * @param operation The Host may set the periodic advertising data in one or
  *        more operations using the operation parameter in the command.
  *        Values:
  *        - 0x00: Intermediate fragment of fragmented periodic advertising data
  *        - 0x01: First fragment of fragmented periodic advertising data
  *        - 0x02: Last fragment of fragmented periodic advertising data
  *        - 0x03: Complete periodic advertising data
  * @param advertising_data_length The number of octets in the Advertising Data
  *        parameter
  *        Values:
  *        - 0 ... 252: The number of octets in the Advertising Data parameter
  * @param advertising_data Periodic advertising data formatted as defined in
  *        [Vol 3] Part C, Section 11. Note: This parameter has a variable
  *        length.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_periodic_advertising_data_nwk(uint8_t advertising_handle,
                                                       uint8_t operation,
                                                       uint8_t advertising_data_length,
                                                       uint8_t advertising_data[])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_set_periodic_advertising_data_nwk_cp0 *cp0 = (aci_gap_set_periodic_advertising_data_nwk_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->advertising_handle = HTOB(advertising_handle, 1);
  index_input += 1;
  cp0->operation = HTOB(operation, 1);
  index_input += 1;
  cp0->advertising_data_length = HTOB(advertising_data_length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB07_06_MEMCPY((void *) &cp0->advertising_data,
                   (const void *) advertising_data,
                   advertising_data_length * sizeof(uint8_t));
    index_input += advertising_data_length * sizeof(uint8_t);
  }
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0b6;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief The GAP_Set_Periodic_Advertising_Enable command is used to request the
  *        Controller to enable or disable the periodic advertising for the
  *        advertising set specified by the advertising_handle parameter
  *        (ordinary advertising is not affected). See
  *        hci_le_set_periodic_advertising_enable().
  * @param enable It is used to request the Controller to enable or disable the
  *        periodic advertising for the advertising set specified by the
  *        advertising_handle parameter (ordinary advertising is not affected).
  *        Values:
  *        - 0x00: Periodic advertising is disabled (default)
  *        - 0x01: Periodic advertising is enabled
  * @param advertising_handle
  *        Values:
  *        - 0x00 ... 0xEF: Used to identify an advertising set
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_periodic_advertising_enable(uint8_t enable,
                                                     uint8_t advertising_handle)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_set_periodic_advertising_enable_cp0 *cp0 = (aci_gap_set_periodic_advertising_enable_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->enable = HTOB(enable, 1);
  index_input += 1;
  cp0->advertising_handle = HTOB(advertising_handle, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0b7;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

