zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/controller/stm32wb07_06_gap_aci.c
/**
  * @brief The GAP_Periodic_Advertising_Create_Sync command is used to
  *        synchronize with periodic advertising from an advertiser and begin
  *        receiving periodic advertising packets. See
  *        hci_le_periodic_advertising_create_sync().
  * @param options The options parameter is used to determine whether the
  *        Periodic Advertiser List is used and whether
  *        HCI_Periodic_Advertising_Report events for this periodic advertising
  *        train are initially enabled or disabled. If bit 0 is set, the Periodic
  *        Advertiser List is used to determine which advertiser to listen to. If
  *        the Periodic Advertiser List is not used, the advertising_sid,
  *        Advertiser address_type, and Advertiser Address parameters specify the
  *        periodic advertising device to listen to; otherwise they shall be
  *        ignored. If bit 1 is set, reporting is initially disabled, otherwise
  *        it is enabled.
  *        Flags:
  *        - 0x01: USE_PERIODIC_ADV_LIST
  *        - 0x02: DISABLE_REPORTING
  * @param advertising_sid The advertising_sid parameter, if used, specifies the
  *        value that must match the Advertising SID subfield in the ADI field of
  *        the received advertisement for it to be used to synchronize.
  *        Values:
  *        - 0x00 ... 0x0F: Advertising SID subfield in the ADI field used to identify the Periodic
  *          Advertising
  * @param advertising_address_type Advertising address type
  *        Values:
  *        - 0x00: Public Device Address
  *        - 0x01: Random Device Address
  * @param advertising_address Public Device Address, Random Device Address,
  *        Public Identity Address, or Random (static) Identity Address of the
  *        advertiser
  * @param skip The Skip parameter specifies the number of consecutive periodic
  *        advertising packets that the receiver may skip after successfully
  *        receiving a periodic advertising packet.
  *        Values:
  *        - 0x0000 ... 0x01F3
  * @param sync_timeout The Skip parameter specifies the number of consecutive
  *        periodic advertising packets that the receiver may skip after
  *        successfully receiving a periodic advertising packet. Time = N*10 ms;
  *        Time Range: 100 ms to 163.84 s.
  *        Values:
  *        - 0x000A (100 ms)  ... 0x4000 (163840 ms) : Synchronization timeout for the periodic advertising
  * @param sync_cte_type The sync_cte_type parameter specifies whether to only
  *        synchronize to periodic advertising with certain types of Constant
  *        Tone Extension (a value of 0 indicates that the presence or absence of
  *        a Constant Tone Extension is irrelevant). If the periodic advertising
  *        has the wrong type of Constant Tone Extension then: - If bit 0 of
  *        options is set, the Controller shall ignore this address and SID and
  *        continue to search for other periodic advertisements. - Otherwise, the
  *        Controller shall cancel the synchronization with the error code
  *        Unsupported Remote Feature/Unsupported LMP Feature (0x1A).
  *        Flags:
  *        - 0x01: Do not sync to packets with an AoA Constant Tone Extension
  *        - 0x02: Do not sync to packets with an AoD Constant Tone Extension with 1 microsecond
  *          slots
  *        - 0x04: Do not sync to packets with an AoD Constant Tone Extension with 2 microseconds
  *          slots
  *        - 0x08: Do not sync to packets with a type 3 Constant Tone Extension (currently
  *          reserved for future use)
  *        - 0x10: Do not sync to packets without a Constant Tone Extension
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_periodic_advertising_create_sync(uint8_t options,
                                                      uint8_t advertising_sid,
                                                      uint8_t advertising_address_type,
                                                      uint8_t advertising_address[6],
                                                      uint16_t skip,
                                                      uint16_t sync_timeout,
                                                      uint8_t sync_cte_type)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_periodic_advertising_create_sync_cp0 *cp0 = (aci_gap_periodic_advertising_create_sync_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->options = HTOB(options, 1);
  index_input += 1;
  cp0->advertising_sid = HTOB(advertising_sid, 1);
  index_input += 1;
  cp0->advertising_address_type = HTOB(advertising_address_type, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->advertising_address, (const void *) advertising_address, 6);
  index_input += 6;
  cp0->skip = HTOB(skip, 2);
  index_input += 2;
  cp0->sync_timeout = HTOB(sync_timeout, 2);
  index_input += 2;
  cp0->sync_cte_type = HTOB(sync_cte_type, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0b8;
  rq_t.event = 0x0F;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief The GAP_Periodic_Advertising_Create_Sync_Cancel command is used to
  *        cancel the GAP_Periodic_Advertising_Create_Sync command while it is
  *        pending. See hci_le_periodic_advertising_create_sync_cancel().
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_periodic_advertising_create_sync_cancel(void)
{
  struct hci_request rq_t;
  ble_status_t status = 0;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0b9;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief The GAP_Remove_Advertising_Set command is used to remove an
  *        advertising set from the Controller. If the advertising set
  *        corresponding to the advertising_handle parameter does not exist, then
  *        the Controller shall return the error code Unknown Advertising
  *        Identifier (0x42). If advertising on the advertising set is enabled,
  *        then the Controller shall return the error code Command Disallowed
  *        (0x0C).
  * @param advertising_handle It is used to identify an advertising set
  *        Values:
  *        - 0x00 ... 0xEF: Used to identify an advertising set
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_remove_advertising_set(uint8_t advertising_handle)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_remove_advertising_set_cp0 *cp0 = (aci_gap_remove_advertising_set_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->advertising_handle = HTOB(advertising_handle, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0ba;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief The GAP_Clear_Advertising_Sets command is used to remove all existing
  *        advertising sets from the Controller. If advertising is enabled on any
  *        advertising set, then the Controller shall return the error code
  *        Command Disallowed (0x0C). Note: All advertising sets are cleared on
  *        HCI reset.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_clear_advertising_sets(void)
{
  struct hci_request rq_t;
  ble_status_t status = 0;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0bb;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief The GAP_Periodic_Advertising_Terminate_Sync command is used to stop
  *        reception of the periodic advertising identified by the sync_handle
  *        parameter. See hci_le_periodic_advertising_terminate_sync().
  * @param sync_handle It is used to identify the periodic advertiser
  *        Values:
  *        - 0x0000 ... 0x0EFF: sync_handle to be used to identify the periodic advertiser
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_periodic_advertising_terminate_sync(uint16_t sync_handle)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_periodic_advertising_terminate_sync_cp0 *cp0 =
    (aci_gap_periodic_advertising_terminate_sync_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->sync_handle = HTOB(sync_handle, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0c0;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief Send a slave security request to the master. This command has to be
  *        issued to notify the master of the security requirements of the slave.
  *        The master may encrypt the link, initiate the pairing procedure, or
  *        reject the request.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_add_device_to_periodic_advertiser_list(uint8_t advertiser_address_type,
                                                            uint8_t advertising_address[6],
                                                            uint8_t advertising_sid)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_add_device_to_periodic_advertiser_list_cp0 *cp0 =
    (aci_gap_add_device_to_periodic_advertiser_list_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->advertiser_address_type = HTOB(advertiser_address_type, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->advertising_address, (const void *) advertising_address, 6);
  index_input += 6;
  cp0->advertising_sid = HTOB(advertising_sid, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0c1;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief The GAP_Remove_Device_From_Periodic_Advertiser_List command is used to
  *        remove one device from the list of Periodic Advertisers stored in the
  *        Controller. See hci_le_remove_device_from_periodic_advertising_list().
  * @param advertiser_address_type Advertising Address type
  *        Values:
  *        - 0x00: Public Device Address or Public Identity Address
  *        - 0x01: Random Device Address or Random (static) Identity Address
  * @param advertising_address Public Device Address, Random Device Address,
  *        Public Identity Address, or Random (static) Identity Address of the
  *        advertiser
  * @param advertising_sid It is used to  identify the Periodic Advertising
  *        Values:
  *        - 0x00 ... 0x0F: Advertising SID subfield in the ADI field used to identify the Periodic
  *        Advertising
  *        All other values Reserved for future
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_remove_device_from_periodic_advertising_list(uint8_t advertiser_address_type,
                                                                  uint8_t advertising_address[6],
                                                                  uint8_t advertising_sid)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_remove_device_from_periodic_advertising_list_cp0 *cp0 =
    (aci_gap_remove_device_from_periodic_advertising_list_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->advertiser_address_type = HTOB(advertiser_address_type, 1);
  index_input += 1;
  STM32WB07_06_MEMCPY((void *) &cp0->advertising_address, (const void *) advertising_address, 6);
  index_input += 6;
  cp0->advertising_sid = HTOB(advertising_sid, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0c2;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief The GAP_Clear_Periodic_Advertiser_List command is used to remove all
  *        devices from the list of Periodic Advertisers in the Controller. See
  *        hci_le_clear_periodic_advertiser_list().
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_clear_periodic_advertiser_list(void)
{
  struct hci_request rq_t;
  ble_status_t status = 0;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0c3;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief The GAP_Read_Periodic_Advertiser_List_Size command is used to read the
  *        total number of Periodic Advertiser list entries that can be stored in
  *        the Controller. Note: The number of entries that can be stored is not
  *        fixed and the Controller can change it at any time (e.g., because the
  *        memory used to store the list can also be used for other purposes).
  * @param[out] periodic_advertiser_list_size Total number of Periodic Advertiser
  *             list entries that can be stored in the Controller
  *             Values:
  *             - 0x1F ... 0xFF: Total number of Periodic Advertiser list entries that can be stored in the
  *               Controller
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_read_periodic_advertiser_list_size(uint8_t *periodic_advertiser_list_size)
{
  struct hci_request rq_t;
  aci_gap_read_periodic_advertiser_list_size_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0c4;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *periodic_advertiser_list_size = BTOH(resp.periodic_advertiser_list_size, 1);
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief The ACI_GAP_Set_Periodic_Advertising_Receive_Enable command will
  *        enable or disable reports for the periodic advertising train
  *        identified by the sync_handle parameter. See
  *        hci_le_set_periodic_advertising_receive_enable().
  * @param sync_handle sync_handle identifying the periodic advertising train
  *        Values:
  *        - 0x0000 ... 0x0EFF: sync_handle identifying the periodic advertising train
  * @param enable It determines whether reporting is enabled or disabled
  *        Values:
  *        - 0x00: Reporting disabled
  *        - 0x01: Reporting enabled
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_periodic_advertising_receive_enable(uint16_t sync_handle,
                                                             uint8_t enable)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_set_periodic_advertising_receive_enable_cp0 *cp0 =
    (aci_gap_set_periodic_advertising_receive_enable_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->sync_handle = HTOB(sync_handle, 2);
  index_input += 2;
  cp0->enable = HTOB(enable, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0c5;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief The ACI_GAP_Periodic_Advertising_Sync_Transfer command is used to
  *        instruct the Controller to send synchronization information about the
  *        periodic advertising train identified by the sync_handle parameter to
  *        a connected device. See hci_le_periodic_advertising_sync_transfer().
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param service_data The service_data parameter is a value provided by the
  *        Host for use by the Host of the peer device. It is not used by the
  *        Controller.
  * @param sync_handle Sync handle that identifies the synchronization
  *        information about the periodic advertising train.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_periodic_advertising_sync_transfer(uint16_t connection_handle,
                                                        uint16_t service_data,
                                                        uint16_t sync_handle)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_periodic_advertising_sync_transfer_cp0 *cp0 = (aci_gap_periodic_advertising_sync_transfer_cp0 *)(cmd_buffer);
  aci_gap_periodic_advertising_sync_transfer_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->service_data = HTOB(service_data, 2);
  index_input += 2;
  cp0->sync_handle = HTOB(sync_handle, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0c6;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief The ACI_GAP_Periodic_Advertising_Set_Info_Transfer command is used to
  *        instruct the Controller to send synchronization information about the
  *        periodic advertising in an advertising set to a connected device. See
  *        hci_le_periodic_advertising_set_info_transfer()
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param service_data It is a value provided by the Host to identify the
  *        periodic advertising train to the peer device. It is not used by the
  *        Controller.
  * @param advertising_handle It is used to identify an advertising set
  *        Values:
  *        - 0x00 ... 0xEF
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_periodic_advertising_set_info_transfer(uint16_t connection_handle,
                                                            uint16_t service_data,
                                                            uint8_t advertising_handle)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_periodic_advertising_set_info_transfer_cp0 *cp0 =
    (aci_gap_periodic_advertising_set_info_transfer_cp0 *)(cmd_buffer);
  aci_gap_periodic_advertising_set_info_transfer_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->service_data = HTOB(service_data, 2);
  index_input += 2;
  cp0->advertising_handle = HTOB(advertising_handle, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0c7;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  return BLE_STATUS_SUCCESS;
}

