zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/controller/stm32wb07_06_gap_aci.c
/**
  * @brief The ACI_GAP_Set_Periodic_Advertising_Sync_Transfer_Parameters command
  *        is used to specify how the Controller will process periodic
  *        advertising synchronization information received from the device
  *        identified by the connection_handle parameter (the "transfer mode").
  *        See hci_le_set_periodic_advertising_sync_transfer_parameters().
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param mode The Mode parameter specifies the action to be taken when periodic
  *        advertising synchronization information is received. If Mode is 0x00,
  *        the Controller will ignore the information. Otherwise it will notify
  *        the Host and synchronize to the periodic advertising. Mode also
  *        specifies whether periodic advertising reports are initially enabled
  *        or disabled.
  *        Values:
  *        - 0x00: No attempt is made to synchronize to the periodic advertising and
  *                no HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to the Host.
  *        - 0x01: An HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to the Host.
  *                HCI_LE_Periodic_Advertising_Report events will be disabled.
  *        - 0x02: An HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to the Host.
  *                HCI_LE_Periodic_Advertising_Report events will be enabled.
  * @param skip The Skip parameter specifies the number of consecutive periodic
  *        advertising packets that the receiver may skip after successfully
  *        receiving a periodic advertising packet.
  *        Values:
  *        - 0x0000 ... 0x01F3: The number of periodic advertising packets that can be skipped after
  *                             a successful receive
  * @param sync_timeout The Skip parameter specifies the number of consecutive
  *        periodic advertising packets that the receiver may skip after
  *        successfully receiving a periodic advertising packet. Time = N*10 ms;
  *        Time Range: 100 ms to 163.84 s.
  *        Values:
  *        - 0x000A (100 ms)  ... 0x4000 (163840 ms) : Synchronization timeout for the periodic advertising
  * @param cte_type It specifies whether to only synchronize to periodic
  *        advertising with certain types of Constant Tone Extension. If the
  *        periodic advertiser changes the type of the Constant Tone Extension
  *        after the Controller has synchronized with the periodic advertising,
  *        it shall remain synchronized.
  *        Flags:
  *        - 0x01: Do not sync to packets with an AoA Constant Tone Extension
  *        - 0x02: Do not sync to packets with an AoD Constant Tone Extension with 1 microsecond slots
  *        - 0x04: Do not sync to packets with an AoD Constant Tone Extension with 2 microseconds slots
  *        - 0x10: Do not sync to packets without a Constant Tone Extension
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_periodic_advertising_sync_transfer_parameters(uint16_t connection_handle,
                                                                       uint8_t mode,
                                                                       uint16_t skip,
                                                                       uint16_t sync_timeout,
                                                                       uint8_t cte_type)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_set_periodic_advertising_sync_transfer_parameters_cp0 *cp0 =
    (aci_gap_set_periodic_advertising_sync_transfer_parameters_cp0 *)(cmd_buffer);
  aci_gap_set_periodic_advertising_sync_transfer_parameters_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->mode = HTOB(mode, 1);
  index_input += 1;
  cp0->skip = HTOB(skip, 2);
  index_input += 2;
  cp0->sync_timeout = HTOB(sync_timeout, 2);
  index_input += 2;
  cp0->cte_type = HTOB(cte_type, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0c8;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  return BLE_STATUS_SUCCESS;
}

/**
  * @brief The ACI_GAP_Set_Default_Periodic_Advertising_Sync_Transfer_Parameters
  *        command is used to specify the initial value for the mode, skip,
  *        timeout, and Constant Tone Extension type to be used for all
  *        subsequent connections over the LE transport. See
  *        hci_le_set_default_periodic_advertising_sync_transfer_parameters().
  * @param mode The Mode parameter specifies the initial action to be taken. If
  *        Mode is 0x00, the Controller will ignore the information. Otherwise it
  *        will notify the Host and synchronize to the periodic advertising. Mode
  *        also specifies whether periodic advertising reports are initially
  *        enabled or disabled.
  *        Values:
  *        - 0x00: No attempt is made to synchronize to the periodic advertising and no
  *                HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to the Host.
  *        - 0x01: An HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to the Host.
  *                HCI_LE_Periodic_Advertising_Report events will be disabled.
  *        - 0x02: An HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to the Host.
  *                HCI_LE_Periodic_Advertising_Report events will be enabled.
  * @param skip The Skip parameter specifies the number of consecutive periodic
  *        advertising packets that the receiver may skip after successfully
  *        receiving a periodic advertising packet.
  *        Values:
  *        - 0x0000 ... 0x01F3: The number of periodic advertising packets that can be skipped after
  *                     a successful receive
  * @param sync_timeout The Skip parameter specifies the number of consecutive
  *        periodic advertising packets that the receiver may skip after
  *        successfully receiving a periodic advertising packet. Time = N*10 ms;
  *        Time Range: 100 ms to 163.84 s.
  *        Values:
  *        - 0x000A (100 ms)  ... 0x4000 (163840 ms) : Synchronization timeout for the periodic advertising
  * @param cte_type The cte_type parameter specifies whether to only synchronize
  *        to periodic advertising with certain types of Constant Tone Extension.
  *        If the periodic advertiser changes the type of the Constant Tone
  *        Extension after the Controller has synchronized with the periodic
  *        advertising, it shall remain synchronized.
  *        Flags:
  *        - 0x01: Do not sync to packets with an AoA Constant Tone Extension
  *        - 0x02: Do not sync to packets with an AoD Constant Tone Extension with 1 microsecond slots
  *        - 0x04: Do not sync to packets with an AoD Constant Tone Extension with 2 microseconds slots
  *        - 0x10: Do not sync to packets without a Constant Tone Extension
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_default_periodic_advertising_sync_transfer_parameters(uint8_t mode,
                                                                               uint16_t skip,
                                                                               uint16_t sync_timeout,
                                                                               uint8_t cte_type)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_gap_set_default_periodic_advertising_sync_transfer_parameters_cp0 *cp0 =
    (aci_gap_set_default_periodic_advertising_sync_transfer_parameters_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->mode = HTOB(mode, 1);
  index_input += 1;
  cp0->skip = HTOB(skip, 2);
  index_input += 2;
  cp0->sync_timeout = HTOB(sync_timeout, 2);
  index_input += 2;
  cp0->cte_type = HTOB(cte_type, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x0c9;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
